GopalSaraf/Practicals/PSDL/include/proc/pic18f85k90.inc
// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 0EFAh
// bitfield definitions
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SE33_POSN                         equ 0001h
LCDSE4_SE33_POSITION                     equ 0001h
LCDSE4_SE33_SIZE                         equ 0001h
LCDSE4_SE33_LENGTH                       equ 0001h
LCDSE4_SE33_MASK                         equ 0002h
LCDSE4_SE34_POSN                         equ 0002h
LCDSE4_SE34_POSITION                     equ 0002h
LCDSE4_SE34_SIZE                         equ 0001h
LCDSE4_SE34_LENGTH                       equ 0001h
LCDSE4_SE34_MASK                         equ 0004h
LCDSE4_SE35_POSN                         equ 0003h
LCDSE4_SE35_POSITION                     equ 0003h
LCDSE4_SE35_SIZE                         equ 0001h
LCDSE4_SE35_LENGTH                       equ 0001h
LCDSE4_SE35_MASK                         equ 0008h
LCDSE4_SE36_POSN                         equ 0004h
LCDSE4_SE36_POSITION                     equ 0004h
LCDSE4_SE36_SIZE                         equ 0001h
LCDSE4_SE36_LENGTH                       equ 0001h
LCDSE4_SE36_MASK                         equ 0010h
LCDSE4_SE37_POSN                         equ 0005h
LCDSE4_SE37_POSITION                     equ 0005h
LCDSE4_SE37_SIZE                         equ 0001h
LCDSE4_SE37_LENGTH                       equ 0001h
LCDSE4_SE37_MASK                         equ 0020h
LCDSE4_SE38_POSN                         equ 0006h
LCDSE4_SE38_POSITION                     equ 0006h
LCDSE4_SE38_SIZE                         equ 0001h
LCDSE4_SE38_LENGTH                       equ 0001h
LCDSE4_SE38_MASK                         equ 0040h
LCDSE4_SE39_POSN                         equ 0007h
LCDSE4_SE39_POSITION                     equ 0007h
LCDSE4_SE39_SIZE                         equ 0001h
LCDSE4_SE39_LENGTH                       equ 0001h
LCDSE4_SE39_MASK                         equ 0080h

// Register: LCDSE5
#define LCDSE5 LCDSE5
LCDSE5                                   equ 0EFBh
// bitfield definitions
LCDSE5_SE40_POSN                         equ 0000h
LCDSE5_SE40_POSITION                     equ 0000h
LCDSE5_SE40_SIZE                         equ 0001h
LCDSE5_SE40_LENGTH                       equ 0001h
LCDSE5_SE40_MASK                         equ 0001h
LCDSE5_SE41_POSN                         equ 0001h
LCDSE5_SE41_POSITION                     equ 0001h
LCDSE5_SE41_SIZE                         equ 0001h
LCDSE5_SE41_LENGTH                       equ 0001h
LCDSE5_SE41_MASK                         equ 0002h
LCDSE5_SE42_POSN                         equ 0002h
LCDSE5_SE42_POSITION                     equ 0002h
LCDSE5_SE42_SIZE                         equ 0001h
LCDSE5_SE42_LENGTH                       equ 0001h
LCDSE5_SE42_MASK                         equ 0004h
LCDSE5_SE43_POSN                         equ 0003h
LCDSE5_SE43_POSITION                     equ 0003h
LCDSE5_SE43_SIZE                         equ 0001h
LCDSE5_SE43_LENGTH                       equ 0001h
LCDSE5_SE43_MASK                         equ 0008h
LCDSE5_SE44_POSN                         equ 0004h
LCDSE5_SE44_POSITION                     equ 0004h
LCDSE5_SE44_SIZE                         equ 0001h
LCDSE5_SE44_LENGTH                       equ 0001h
LCDSE5_SE44_MASK                         equ 0010h
LCDSE5_SE45_POSN                         equ 0005h
LCDSE5_SE45_POSITION                     equ 0005h
LCDSE5_SE45_SIZE                         equ 0001h
LCDSE5_SE45_LENGTH                       equ 0001h
LCDSE5_SE45_MASK                         equ 0020h
LCDSE5_SE46_POSN                         equ 0006h
LCDSE5_SE46_POSITION                     equ 0006h
LCDSE5_SE46_SIZE                         equ 0001h
LCDSE5_SE46_LENGTH                       equ 0001h
LCDSE5_SE46_MASK                         equ 0040h
LCDSE5_SE47_POSN                         equ 0007h
LCDSE5_SE47_POSITION                     equ 0007h
LCDSE5_SE47_SIZE                         equ 0001h
LCDSE5_SE47_LENGTH                       equ 0001h
LCDSE5_SE47_MASK                         equ 0080h

// Register: LCDRL
#define LCDRL LCDRL
LCDRL                                    equ 0EFCh
// bitfield definitions
LCDRL_LRLAT_POSN                         equ 0000h
LCDRL_LRLAT_POSITION                     equ 0000h
LCDRL_LRLAT_SIZE                         equ 0003h
LCDRL_LRLAT_LENGTH                       equ 0003h
LCDRL_LRLAT_MASK                         equ 0007h
LCDRL_LCDIRI_POSN                        equ 0003h
LCDRL_LCDIRI_POSITION                    equ 0003h
LCDRL_LCDIRI_SIZE                        equ 0001h
LCDRL_LCDIRI_LENGTH                      equ 0001h
LCDRL_LCDIRI_MASK                        equ 0008h
LCDRL_LRLBP_POSN                         equ 0004h
LCDRL_LRLBP_POSITION                     equ 0004h
LCDRL_LRLBP_SIZE                         equ 0002h
LCDRL_LRLBP_LENGTH                       equ 0002h
LCDRL_LRLBP_MASK                         equ 0030h
LCDRL_LRLAP_POSN                         equ 0006h
LCDRL_LRLAP_POSITION                     equ 0006h
LCDRL_LRLAP_SIZE                         equ 0002h
LCDRL_LRLAP_LENGTH                       equ 0002h
LCDRL_LRLAP_MASK                         equ 00C0h
LCDRL_LRLAT0_POSN                        equ 0000h
LCDRL_LRLAT0_POSITION                    equ 0000h
LCDRL_LRLAT0_SIZE                        equ 0001h
LCDRL_LRLAT0_LENGTH                      equ 0001h
LCDRL_LRLAT0_MASK                        equ 0001h
LCDRL_LRLAT1_POSN                        equ 0001h
LCDRL_LRLAT1_POSITION                    equ 0001h
LCDRL_LRLAT1_SIZE                        equ 0001h
LCDRL_LRLAT1_LENGTH                      equ 0001h
LCDRL_LRLAT1_MASK                        equ 0002h
LCDRL_LRLAT2_POSN                        equ 0002h
LCDRL_LRLAT2_POSITION                    equ 0002h
LCDRL_LRLAT2_SIZE                        equ 0001h
LCDRL_LRLAT2_LENGTH                      equ 0001h
LCDRL_LRLAT2_MASK                        equ 0004h
LCDRL_LRLBP0_POSN                        equ 0004h
LCDRL_LRLBP0_POSITION                    equ 0004h
LCDRL_LRLBP0_SIZE                        equ 0001h
LCDRL_LRLBP0_LENGTH                      equ 0001h
LCDRL_LRLBP0_MASK                        equ 0010h
LCDRL_LRLBP1_POSN                        equ 0005h
LCDRL_LRLBP1_POSITION                    equ 0005h
LCDRL_LRLBP1_SIZE                        equ 0001h
LCDRL_LRLBP1_LENGTH                      equ 0001h
LCDRL_LRLBP1_MASK                        equ 0020h
LCDRL_LRLAP0_POSN                        equ 0006h
LCDRL_LRLAP0_POSITION                    equ 0006h
LCDRL_LRLAP0_SIZE                        equ 0001h
LCDRL_LRLAP0_LENGTH                      equ 0001h
LCDRL_LRLAP0_MASK                        equ 0040h
LCDRL_LRLAP1_POSN                        equ 0007h
LCDRL_LRLAP1_POSITION                    equ 0007h
LCDRL_LRLAP1_SIZE                        equ 0001h
LCDRL_LRLAP1_LENGTH                      equ 0001h
LCDRL_LRLAP1_MASK                        equ 0080h

// Register: LCDREF
#define LCDREF LCDREF
LCDREF                                   equ 0EFDh
// bitfield definitions
LCDREF_VLCD1PE_POSN                      equ 0000h
LCDREF_VLCD1PE_POSITION                  equ 0000h
LCDREF_VLCD1PE_SIZE                      equ 0001h
LCDREF_VLCD1PE_LENGTH                    equ 0001h
LCDREF_VLCD1PE_MASK                      equ 0001h
LCDREF_VLCD2PE_POSN                      equ 0001h
LCDREF_VLCD2PE_POSITION                  equ 0001h
LCDREF_VLCD2PE_SIZE                      equ 0001h
LCDREF_VLCD2PE_LENGTH                    equ 0001h
LCDREF_VLCD2PE_MASK                      equ 0002h
LCDREF_VLCD3PE_POSN                      equ 0002h
LCDREF_VLCD3PE_POSITION                  equ 0002h
LCDREF_VLCD3PE_SIZE                      equ 0001h
LCDREF_VLCD3PE_LENGTH                    equ 0001h
LCDREF_VLCD3PE_MASK                      equ 0004h
LCDREF_LCDCST_POSN                       equ 0003h
LCDREF_LCDCST_POSITION                   equ 0003h
LCDREF_LCDCST_SIZE                       equ 0003h
LCDREF_LCDCST_LENGTH                     equ 0003h
LCDREF_LCDCST_MASK                       equ 0038h
LCDREF_LCDIRS_POSN                       equ 0006h
LCDREF_LCDIRS_POSITION                   equ 0006h
LCDREF_LCDIRS_SIZE                       equ 0001h
LCDREF_LCDIRS_LENGTH                     equ 0001h
LCDREF_LCDIRS_MASK                       equ 0040h
LCDREF_LCDIRE_POSN                       equ 0007h
LCDREF_LCDIRE_POSITION                   equ 0007h
LCDREF_LCDIRE_SIZE                       equ 0001h
LCDREF_LCDIRE_LENGTH                     equ 0001h
LCDREF_LCDIRE_MASK                       equ 0080h
LCDREF_LCDCST0_POSN                      equ 0003h
LCDREF_LCDCST0_POSITION                  equ 0003h
LCDREF_LCDCST0_SIZE                      equ 0001h
LCDREF_LCDCST0_LENGTH                    equ 0001h
LCDREF_LCDCST0_MASK                      equ 0008h
LCDREF_LCDCST1_POSN                      equ 0004h
LCDREF_LCDCST1_POSITION                  equ 0004h
LCDREF_LCDCST1_SIZE                      equ 0001h
LCDREF_LCDCST1_LENGTH                    equ 0001h
LCDREF_LCDCST1_MASK                      equ 0010h
LCDREF_LCDCST2_POSN                      equ 0005h
LCDREF_LCDCST2_POSITION                  equ 0005h
LCDREF_LCDCST2_SIZE                      equ 0001h
LCDREF_LCDCST2_LENGTH                    equ 0001h
LCDREF_LCDCST2_MASK                      equ 0020h

// Register: SSP2CON2
#define SSP2CON2 SSP2CON2
SSP2CON2                                 equ 0EFEh
// bitfield definitions
SSP2CON2_SEN_POSN                        equ 0000h
SSP2CON2_SEN_POSITION                    equ 0000h
SSP2CON2_SEN_SIZE                        equ 0001h
SSP2CON2_SEN_LENGTH                      equ 0001h
SSP2CON2_SEN_MASK                        equ 0001h
SSP2CON2_RSEN_POSN                       equ 0001h
SSP2CON2_RSEN_POSITION                   equ 0001h
SSP2CON2_RSEN_SIZE                       equ 0001h
SSP2CON2_RSEN_LENGTH                     equ 0001h
SSP2CON2_RSEN_MASK                       equ 0002h
SSP2CON2_PEN_POSN                        equ 0002h
SSP2CON2_PEN_POSITION                    equ 0002h
SSP2CON2_PEN_SIZE                        equ 0001h
SSP2CON2_PEN_LENGTH                      equ 0001h
SSP2CON2_PEN_MASK                        equ 0004h
SSP2CON2_RCEN_POSN                       equ 0003h
SSP2CON2_RCEN_POSITION                   equ 0003h
SSP2CON2_RCEN_SIZE                       equ 0001h
SSP2CON2_RCEN_LENGTH                     equ 0001h
SSP2CON2_RCEN_MASK                       equ 0008h
SSP2CON2_ACKEN_POSN                      equ 0004h
SSP2CON2_ACKEN_POSITION                  equ 0004h
SSP2CON2_ACKEN_SIZE                      equ 0001h
SSP2CON2_ACKEN_LENGTH                    equ 0001h
SSP2CON2_ACKEN_MASK                      equ 0010h
SSP2CON2_ACKDT_POSN                      equ 0005h
SSP2CON2_ACKDT_POSITION                  equ 0005h
SSP2CON2_ACKDT_SIZE                      equ 0001h
SSP2CON2_ACKDT_LENGTH                    equ 0001h
SSP2CON2_ACKDT_MASK                      equ 0020h
SSP2CON2_ACKSTAT_POSN                    equ 0006h
SSP2CON2_ACKSTAT_POSITION                equ 0006h
SSP2CON2_ACKSTAT_SIZE                    equ 0001h
SSP2CON2_ACKSTAT_LENGTH                  equ 0001h
SSP2CON2_ACKSTAT_MASK                    equ 0040h
SSP2CON2_GCEN_POSN                       equ 0007h
SSP2CON2_GCEN_POSITION                   equ 0007h
SSP2CON2_GCEN_SIZE                       equ 0001h
SSP2CON2_GCEN_LENGTH                     equ 0001h
SSP2CON2_GCEN_MASK                       equ 0080h
SSP2CON2_ADMSK1_POSN                     equ 0001h
SSP2CON2_ADMSK1_POSITION                 equ 0001h
SSP2CON2_ADMSK1_SIZE                     equ 0001h
SSP2CON2_ADMSK1_LENGTH                   equ 0001h
SSP2CON2_ADMSK1_MASK                     equ 0002h
SSP2CON2_ADMSK2_POSN                     equ 0002h
SSP2CON2_ADMSK2_POSITION                 equ 0002h
SSP2CON2_ADMSK2_SIZE                     equ 0001h
SSP2CON2_ADMSK2_LENGTH                   equ 0001h
SSP2CON2_ADMSK2_MASK                     equ 0004h
SSP2CON2_ADMSK3_POSN                     equ 0003h
SSP2CON2_ADMSK3_POSITION                 equ 0003h
SSP2CON2_ADMSK3_SIZE                     equ 0001h
SSP2CON2_ADMSK3_LENGTH                   equ 0001h
SSP2CON2_ADMSK3_MASK                     equ 0008h
SSP2CON2_ADMSK4_POSN                     equ 0004h
SSP2CON2_ADMSK4_POSITION                 equ 0004h
SSP2CON2_ADMSK4_SIZE                     equ 0001h
SSP2CON2_ADMSK4_LENGTH                   equ 0001h
SSP2CON2_ADMSK4_MASK                     equ 0010h
SSP2CON2_ADMSK5_POSN                     equ 0005h
SSP2CON2_ADMSK5_POSITION                 equ 0005h
SSP2CON2_ADMSK5_SIZE                     equ 0001h
SSP2CON2_ADMSK5_LENGTH                   equ 0001h
SSP2CON2_ADMSK5_MASK                     equ 0020h
SSP2CON2_SEN2_POSN                       equ 0000h
SSP2CON2_SEN2_POSITION                   equ 0000h
SSP2CON2_SEN2_SIZE                       equ 0001h
SSP2CON2_SEN2_LENGTH                     equ 0001h
SSP2CON2_SEN2_MASK                       equ 0001h
SSP2CON2_ADMSK12_POSN                    equ 0001h
SSP2CON2_ADMSK12_POSITION                equ 0001h
SSP2CON2_ADMSK12_SIZE                    equ 0001h
SSP2CON2_ADMSK12_LENGTH                  equ 0001h
SSP2CON2_ADMSK12_MASK                    equ 0002h
SSP2CON2_ADMSK22_POSN                    equ 0002h
SSP2CON2_ADMSK22_POSITION                equ 0002h
SSP2CON2_ADMSK22_SIZE                    equ 0001h
SSP2CON2_ADMSK22_LENGTH                  equ 0001h
SSP2CON2_ADMSK22_MASK                    equ 0004h
SSP2CON2_ADMSK32_POSN                    equ 0003h
SSP2CON2_ADMSK32_POSITION                equ 0003h
SSP2CON2_ADMSK32_SIZE                    equ 0001h
SSP2CON2_ADMSK32_LENGTH                  equ 0001h
SSP2CON2_ADMSK32_MASK                    equ 0008h
SSP2CON2_ACKEN2_POSN                     equ 0004h
SSP2CON2_ACKEN2_POSITION                 equ 0004h
SSP2CON2_ACKEN2_SIZE                     equ 0001h
SSP2CON2_ACKEN2_LENGTH                   equ 0001h
SSP2CON2_ACKEN2_MASK                     equ 0010h
SSP2CON2_ACKDT2_POSN                     equ 0005h
SSP2CON2_ACKDT2_POSITION                 equ 0005h
SSP2CON2_ACKDT2_SIZE                     equ 0001h
SSP2CON2_ACKDT2_LENGTH                   equ 0001h
SSP2CON2_ACKDT2_MASK                     equ 0020h
SSP2CON2_ACKSTAT2_POSN                   equ 0006h
SSP2CON2_ACKSTAT2_POSITION               equ 0006h
SSP2CON2_ACKSTAT2_SIZE                   equ 0001h
SSP2CON2_ACKSTAT2_LENGTH                 equ 0001h
SSP2CON2_ACKSTAT2_MASK                   equ 0040h
SSP2CON2_GCEN2_POSN                      equ 0007h
SSP2CON2_GCEN2_POSITION                  equ 0007h
SSP2CON2_GCEN2_SIZE                      equ 0001h
SSP2CON2_GCEN2_LENGTH                    equ 0001h
SSP2CON2_GCEN2_MASK                      equ 0080h
SSP2CON2_RSEN2_POSN                      equ 0001h
SSP2CON2_RSEN2_POSITION                  equ 0001h
SSP2CON2_RSEN2_SIZE                      equ 0001h
SSP2CON2_RSEN2_LENGTH                    equ 0001h
SSP2CON2_RSEN2_MASK                      equ 0002h
SSP2CON2_PEN2_POSN                       equ 0002h
SSP2CON2_PEN2_POSITION                   equ 0002h
SSP2CON2_PEN2_SIZE                       equ 0001h
SSP2CON2_PEN2_LENGTH                     equ 0001h
SSP2CON2_PEN2_MASK                       equ 0004h
SSP2CON2_RCEN2_POSN                      equ 0003h
SSP2CON2_RCEN2_POSITION                  equ 0003h
SSP2CON2_RCEN2_SIZE                      equ 0001h
SSP2CON2_RCEN2_LENGTH                    equ 0001h
SSP2CON2_RCEN2_MASK                      equ 0008h
SSP2CON2_ADMSK42_POSN                    equ 0004h
SSP2CON2_ADMSK42_POSITION                equ 0004h
SSP2CON2_ADMSK42_SIZE                    equ 0001h
SSP2CON2_ADMSK42_LENGTH                  equ 0001h
SSP2CON2_ADMSK42_MASK                    equ 0010h
SSP2CON2_ADMSK52_POSN                    equ 0005h
SSP2CON2_ADMSK52_POSITION                equ 0005h
SSP2CON2_ADMSK52_SIZE                    equ 0001h
SSP2CON2_ADMSK52_LENGTH                  equ 0001h
SSP2CON2_ADMSK52_MASK                    equ 0020h

// Register: SSP2CON1
#define SSP2CON1 SSP2CON1
SSP2CON1                                 equ 0EFFh
// bitfield definitions
SSP2CON1_SSPM0_POSN                      equ 0000h
SSP2CON1_SSPM0_POSITION                  equ 0000h
SSP2CON1_SSPM0_SIZE                      equ 0001h
SSP2CON1_SSPM0_LENGTH                    equ 0001h
SSP2CON1_SSPM0_MASK                      equ 0001h
SSP2CON1_SSPM1_POSN                      equ 0001h
SSP2CON1_SSPM1_POSITION                  equ 0001h
SSP2CON1_SSPM1_SIZE                      equ 0001h
SSP2CON1_SSPM1_LENGTH                    equ 0001h
SSP2CON1_SSPM1_MASK                      equ 0002h
SSP2CON1_SSPM2_POSN                      equ 0002h
SSP2CON1_SSPM2_POSITION                  equ 0002h
SSP2CON1_SSPM2_SIZE                      equ 0001h
SSP2CON1_SSPM2_LENGTH                    equ 0001h
SSP2CON1_SSPM2_MASK                      equ 0004h
SSP2CON1_SSPM3_POSN                      equ 0003h
SSP2CON1_SSPM3_POSITION                  equ 0003h
SSP2CON1_SSPM3_SIZE                      equ 0001h
SSP2CON1_SSPM3_LENGTH                    equ 0001h
SSP2CON1_SSPM3_MASK                      equ 0008h
SSP2CON1_CKP_POSN                        equ 0004h
SSP2CON1_CKP_POSITION                    equ 0004h
SSP2CON1_CKP_SIZE                        equ 0001h
SSP2CON1_CKP_LENGTH                      equ 0001h
SSP2CON1_CKP_MASK                        equ 0010h
SSP2CON1_SSPEN_POSN                      equ 0005h
SSP2CON1_SSPEN_POSITION                  equ 0005h
SSP2CON1_SSPEN_SIZE                      equ 0001h
SSP2CON1_SSPEN_LENGTH                    equ 0001h
SSP2CON1_SSPEN_MASK                      equ 0020h
SSP2CON1_SSPOV_POSN                      equ 0006h
SSP2CON1_SSPOV_POSITION                  equ 0006h
SSP2CON1_SSPOV_SIZE                      equ 0001h
SSP2CON1_SSPOV_LENGTH                    equ 0001h
SSP2CON1_SSPOV_MASK                      equ 0040h
SSP2CON1_WCOL_POSN                       equ 0007h
SSP2CON1_WCOL_POSITION                   equ 0007h
SSP2CON1_WCOL_SIZE                       equ 0001h
SSP2CON1_WCOL_LENGTH                     equ 0001h
SSP2CON1_WCOL_MASK                       equ 0080h
SSP2CON1_SSPM_POSN                       equ 0000h
SSP2CON1_SSPM_POSITION                   equ 0000h
SSP2CON1_SSPM_SIZE                       equ 0004h
SSP2CON1_SSPM_LENGTH                     equ 0004h
SSP2CON1_SSPM_MASK                       equ 000Fh
SSP2CON1_SSPM02_POSN                     equ 0000h
SSP2CON1_SSPM02_POSITION                 equ 0000h
SSP2CON1_SSPM02_SIZE                     equ 0001h
SSP2CON1_SSPM02_LENGTH                   equ 0001h
SSP2CON1_SSPM02_MASK                     equ 0001h
SSP2CON1_SSPM12_POSN                     equ 0001h
SSP2CON1_SSPM12_POSITION                 equ 0001h
SSP2CON1_SSPM12_SIZE                     equ 0001h
SSP2CON1_SSPM12_LENGTH                   equ 0001h
SSP2CON1_SSPM12_MASK                     equ 0002h
SSP2CON1_SSPM22_POSN                     equ 0002h
SSP2CON1_SSPM22_POSITION                 equ 0002h
SSP2CON1_SSPM22_SIZE                     equ 0001h
SSP2CON1_SSPM22_LENGTH                   equ 0001h
SSP2CON1_SSPM22_MASK                     equ 0004h
SSP2CON1_SSPM32_POSN                     equ 0003h
SSP2CON1_SSPM32_POSITION                 equ 0003h
SSP2CON1_SSPM32_SIZE                     equ 0001h
SSP2CON1_SSPM32_LENGTH                   equ 0001h
SSP2CON1_SSPM32_MASK                     equ 0008h
SSP2CON1_CKP2_POSN                       equ 0004h
SSP2CON1_CKP2_POSITION                   equ 0004h
SSP2CON1_CKP2_SIZE                       equ 0001h
SSP2CON1_CKP2_LENGTH                     equ 0001h
SSP2CON1_CKP2_MASK                       equ 0010h
SSP2CON1_SSPEN2_POSN                     equ 0005h
SSP2CON1_SSPEN2_POSITION                 equ 0005h
SSP2CON1_SSPEN2_SIZE                     equ 0001h
SSP2CON1_SSPEN2_LENGTH                   equ 0001h
SSP2CON1_SSPEN2_MASK                     equ 0020h
SSP2CON1_SSPOV2_POSN                     equ 0006h
SSP2CON1_SSPOV2_POSITION                 equ 0006h
SSP2CON1_SSPOV2_SIZE                     equ 0001h
SSP2CON1_SSPOV2_LENGTH                   equ 0001h
SSP2CON1_SSPOV2_MASK                     equ 0040h
SSP2CON1_WCOL2_POSN                      equ 0007h
SSP2CON1_WCOL2_POSITION                  equ 0007h
SSP2CON1_WCOL2_SIZE                      equ 0001h
SSP2CON1_WCOL2_LENGTH                    equ 0001h
SSP2CON1_WCOL2_MASK                      equ 0080h

